<template>
  <div id="index-page">
    <h1>高效前端——Web高效编程与优化实践</h1>

    <h2>第一章：HTML/CSS优化</h2>

    <p>1.能用css解决的问题就别用js，如二级导航等问题</p>
    <p>
      2.多列等高的两种实现方式<br/>
      第一种、大padding大负margin矫正<br/>
      第二种、table的自适应实现
    </p>

    <div class="container_dhdg1">
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
    </div>

    <div class="container_dhdg2">
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
    </div>

    <p>3.多使用伪元素</p>
    <div class="fakeElement">
      Or
    </div>
    <div class="clear100"></div>
    <h2>第二章：JS优化</h2>
    <ul>
      <li>1.减少前端代码耦合（低耦合高内聚）</li>
      <li>2.避免污染全局</li>
      <li>3.优化代码风格</li>
      <li>4.减少作用域查询</li>
    </ul>

    <div class="clear100"></div>
    <h2>第三章：页面优化</h2>
    <p>
      页面渲染流程、
      javascript➡Style➡Layout➡Paint➡Composite
      <br/>
      1s/60= 16.67ms内完成
    </p>
    <p>
      1.减少layout，减少页面重绘如能用transform就不用position/width/height做动画效果<br/>
      2.减少Dom结构，用Flex比用Float需要重绘的元素少<br/>
      3.减少head标签里的css资源<br/>
      4.优化图片-使用响应式图片（srcset）、延迟加载图片、压缩和缓存<br/>
      5.DNS预读取、html压缩优化
    </p>
    <h4>增强用户体验</h4>
    <p>
      1.加loading效果<br/>
      2.过渡效果<br/>
      3.按钮以及表单的交互效果<br/>
      4.记住用户的一些数据，如常用滚动位置，部分表单信息<br/>
      5.
    </p>
    <div class="button">
      THIS IS A BUTTON
    </div>


    <div class="clear100"></div>
    <h2>第四章：HTML5优化实践</h2>
    
  </div>
</template>

<script>
import Header from '../../components/Header';
import Logo from '../../components/Logo';

export default {
  name: 'IndexPage',
  components: {
    TopHeader: Header,
    Logo,
  },
};
</script>

<style lang="scss">
  @import './index.scss'
</style>
