<template>
  <div id="index-page">
    <h1>高效前端——Web高效编程与优化实践</h1>

    <h2>第一章：HTML/CSS优化</h2>

    <p>1.能用css解决的问题就别用js，如二级导航等问题</p>
    <p>
      2.多列等高的两种实现方式<br/>
      第一种、大padding大负margin矫正<br/>
      第二种、table的自适应实现
    </p>

    <div class="container_dhdg1">
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
    </div>

    <div class="container_dhdg2">
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
      <div>多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式多列等高实现方式</div>
    </div>

    <p>3.多使用伪元素</p>
    <div class="fakeElement">
      Or
    </div>
  </div>
</template>

<script>
import Header from '../../components/Header';
import Logo from '../../components/Logo';

export default {
  name: 'IndexPage',
  components: {
    TopHeader: Header,
    Logo,
  },
};
</script>

<style lang="scss">
  @import './index.scss'
</style>
